AhmedAbd-ElFattah/STM32-Drivers/HMCAL/TIM/TIM_defs.h
/*
 * File Name --> TIM_defs.h
 * Author	 --> Ahmed Mohamed Abd-Elfattah
 * Version	 --> 1.0.0
 * Layer	 --> HMCAL
 */

#ifndef HMCAL_TIM_TIM_DEFS_H_
#define HMCAL_TIM_TIM_DEFS_H_



/*
==================================================
  Start Section --> Bit definitions
==================================================
*/
/*Timer Control 1 available options section.*/
#define 		TIM_CR1_CEN                                                                         0
#define 		TIM_CR1_UDIS                                                                        1
#define 		TIM_CR1_URS                                                                         2
#define 		TIM_CR1_OPM                                                                         3
#define 		TIM_CR1_DIR                                                                         4
#define 		TIM_CR1_CMS_0                                                                       5
#define 		TIM_CR1_CMS_1                                                                       6
#define 		TIM_CR1_ARPE                                                                        7
#define 		TIM_CR1_CKD_0                                                                       8
#define 		TIM_CR1_CKD_1                                                                       9

/*Timer Control 2 available options section.*/
#define 		TIM_CR2_CCPC                                                                        0
#define 		TIM_CR2_CCUS                                                                        2
#define 		TIM_CR2_CCDS                                                                        3
#define 		TIM_CR2_MMS_0                                                                       4
#define 		TIM_CR2_MMS_1                                                                       5
#define 		TIM_CR2_MMS_2                                                                       6
#define 		TIM_CR2_TI1S                                                                        7
#define 		TIM_CR2_OIS1                                                                        8
#define 		TIM_CR2_OIS1N                                                                       9
#define 		TIM_CR2_OIS2                                                                        10
#define 		TIM_CR2_OIS2N                                                                       11
#define 		TIM_CR2_OIS3                                                                        12
#define 		TIM_CR2_OIS3N                                                                       13
#define 		TIM_CR2_OIS4                                                                        14

/*Timer Control slave mode control available options section.*/
#define 		TIM_SMCR_SMS_0                                                                           0
#define 		TIM_SMCR_SMS_1                                                                           1
#define 		TIM_SMCR_SMS_2                                                                           2
#define 		TIM_SMCR_TS_0                                                                            4
#define 		TIM_SMCR_TS_1                                                                            5
#define 		TIM_SMCR_TS_2                                                                            6
#define 		TIM_SMCR_MSM                                                                             7
#define 		TIM_SMCR_ETF_0                                                                           8
#define 		TIM_SMCR_ETF_1                                                                           9
#define 		TIM_SMCR_ETF_2                                                                           10
#define 		TIM_SMCR_ETF_3                                                                           11
#define 		TIM_SMCR_ETPS_0                                                                          12
#define 		TIM_SMCR_ETPS_1                                                                          13
#define 		TIM_SMCR_ECE                                                                             14
#define 		TIM_SMCR_ETP                                                                             15

/*Timer DMA/interrupt enable register available options section.*/
#define 		TIM_DIER_UIE                                                                             0
#define 		TIM_DIER_CC1IE                                                                           1
#define 		TIM_DIER_CC2IE                                                                           2
#define 		TIM_DIER_CC3IE                                                                           3
#define 		TIM_DIER_CC4IE                                                                           4
#define 		TIM_DIER_COMIE                                                                           5
#define 		TIM_DIER_TIE                                                                             6
#define 		TIM_DIER_BIE                                                                             7
#define 		TIM_DIER_UDE                                                                             8
#define 		TIM_DIER_CC1DE                                                                           9
#define 		TIM_DIER_CC2DE                                                                           10
#define 		TIM_DIER_CC3DE                                                                           11
#define 		TIM_DIER_CC4DE                                                                           12
#define 		TIM_DIER_COMDE                                                                           13
#define 		TIM_DIER_TDE                                                                             14

/*Timer status register available options section.*/
#define 		TIM_SR_UIF                                                                             0
#define 		TIM_SR_CC1IF                                                                           1
#define 		TIM_SR_CC2IF                                                                           2
#define 		TIM_SR_CC3IF                                                                           3
#define 		TIM_SR_CC4IF                                                                           4
#define 		TIM_SR_COMIF                                                                           5
#define 		TIM_SR_TIF                                                                             6
#define 		TIM_SR_BIF                                                                             7
#define 		TIM_SR_CC1OF                                                                           9
#define 		TIM_SR_CC2OF                                                                           10
#define 		TIM_SR_CC3OF                                                                           11
#define 		TIM_SR_CC4OF                                                                           12

/*Timer event generation register available options section.*/
#define 		TIM_EGR_UG                                                                              0
#define 		TIM_EGR_CC1G                                                                            1
#define 		TIM_EGR_CC2G                                                                            2
#define 		TIM_EGR_CC3G                                                                            3
#define 		TIM_EGR_CC4G                                                                            4
#define 		TIM_EGR_COMG                                                                            5
#define 		TIM_EGR_TG                                                                              6
#define 		TIM_EGR_BG                                                                              7

/*Timer Capture Compare mode register 1.*/
#define 		TIM_CCMR1_CC1S_0																		0
#define 		TIM_CCMR1_CC1S_1																		1

#define 		TIM_CCMR1_OC1FE																			2
#define 		TIM_CCMR1_OC1PE																			3
#define			TIM_CCMR1_IC1PSC_0																		2
#define			TIM_CCMR1_IC1PSC_1																		3

#define			TIM_CCMR1_OC1M_0																		4
#define			TIM_CCMR1_OC1M_1																		5
#define			TIM_CCMR1_OC1M_2																		6
#define			TIM_CCMR1_OC1CE																			7

