AhmedAbd-ElFattah/STM32-Drivers/HMCAL/TIM/TIM_defs.h
#define			TIM_CCMR1_IC1F_0																		4
#define			TIM_CCMR1_IC1F_1																		5
#define			TIM_CCMR1_IC1F_2																		6
#define			TIM_CCMR1_IC1F_3																		7

#define			TIM_CCMR1_CC2S_0																		8
#define			TIM_CCMR1_CC2S_1																		9

#define			TIM_CCMR1_OC2FE																			10
#define			TIM_CCMR1_OC2PE																			11
#define			TIM_CCMR1_IC2PSC_0																		10
#define			TIM_CCMR1_IC2PSC_1																		11

#define			TIM_CCMR1_OC2M_0																		12
#define			TIM_CCMR1_OC2M_1																		13
#define			TIM_CCMR1_OC2M_2																		14
#define			TIM_CCMR1_OC2E																			15

#define			TIM_CCMR1_IC2F_0																		12
#define			TIM_CCMR1_IC2F_1																		13
#define			TIM_CCMR1_IC2F_2																		14
#define			TIM_CCMR1_IC2F_3																		15

/*Timer Capture Compare mode register 2.*/
#define 		TIM_CCMR2_CC3S_0																		0
#define 		TIM_CCMR2_CC3S_1																		1

#define 		TIM_CCMR2_OC3FE																			2
#define 		TIM_CCMR2_OC3PE																			3
#define			TIM_CCMR2_IC3PSC_0																		2
#define			TIM_CCMR2_IC3PSC_1																		3

#define			TIM_CCMR2_OC3M_0																		4
#define			TIM_CCMR2_OC3M_1																		5
#define			TIM_CCMR2_OC3M_2																		6
#define			TIM_CCMR2_OC3CE																			7

#define			TIM_CCMR2_IC3F_0																		4
#define			TIM_CCMR2_IC3F_1																		5
#define			TIM_CCMR2_IC3F_2																		6
#define			TIM_CCMR2_IC3F_3																		7

#define			TIM_CCMR2_CC4S_0																		8
#define			TIM_CCMR2_CC4S_1																		9

#define			TIM_CCMR2_OC4FE																			10
#define			TIM_CCMR2_OC4PE																			11
#define			TIM_CCMR2_IC4PSC_0																		10
#define			TIM_CCMR2_IC4PSC_1																		11

#define			TIM_CCMR2_OC4M_0																		12
#define			TIM_CCMR2_OC4M_1																		13
#define			TIM_CCMR2_OC4M_2																		14
#define			TIM_CCMR2_OC4E																			15

#define			TIM_CCMR2_IC4F_0																		12
#define			TIM_CCMR2_IC4F_1																		13
#define			TIM_CCMR2_IC4F_2																		14
#define			TIM_CCMR2_IC4F_3																		15

/*Timer event capture/compare enable register available options section.*/
#define 		TIM_CCER_CC1E                                                                            0
#define 		TIM_CCER_CC1P                                                                            1
#define 		TIM_CCER_CC1NE                                                                           2
#define 		TIM_CCER_CC1NP                                                                           3
#define 		TIM_CCER_CC2E                                                                            4
#define 		TIM_CCER_CC2P                                                                            5
#define 		TIM_CCER_CC2NE                                                                           6
#define 		TIM_CCER_CC2NP                                                                           7
#define 		TIM_CCER_CC3E                                                                            8
#define 		TIM_CCER_CC3P                                                                            9
#define 		TIM_CCER_CC3NE                                                                           10
#define 		TIM_CCER_CC3NP                                                                           11
#define 		TIM_CCER_CC4E                                                                            12
#define 		TIM_CCER_CC4P                                                                            13
#define 		TIM_CCER_CC4NP                                                                           15

/*CNT (TIM counter) Bits.*/

#define 		TIM_CNT_CNT_0                                                                   0
#define 		TIM_CNT_CNT_1                                                                   1
#define 		TIM_CNT_CNT_2                                                                   2
#define 		TIM_CNT_CNT_3                                                                   3
#define 		TIM_CNT_CNT_4                                                                   4
#define 		TIM_CNT_CNT_5                                                                   5
#define 		TIM_CNT_CNT_6                                                                   6
#define 		TIM_CNT_CNT_7                                                                   7
#define 		TIM_CNT_CNT_8                                                                   8
#define 		TIM_CNT_CNT_9                                                                   9
#define 		TIM_CNT_CNT_10                                                                  10
#define 		TIM_CNT_CNT_11                                                                  11
#define 		TIM_CNT_CNT_12                                                                  12
#define 		TIM_CNT_CNT_13                                                                  13
#define 		TIM_CNT_CNT_14                                                                  14
#define 		TIM_CNT_CNT_15                                                                  15

/*PSC (TIM Prescaler) Bits.*/

#define 		TIM_PSC_PSC_0                                                                   0
#define 		TIM_PSC_PSC_1                                                                   1
#define 		TIM_PSC_PSC_2                                                                   2
#define 		TIM_PSC_PSC_3                                                                   3
#define 		TIM_PSC_PSC_4                                                                   4
#define 		TIM_PSC_PSC_5                                                                   5
#define 		TIM_PSC_PSC_6                                                                   6
#define 		TIM_PSC_PSC_7                                                                   7
#define 		TIM_PSC_PSC_8                                                                   8
#define 		TIM_PSC_PSC_9                                                                   9
#define 		TIM_PSC_PSC_10                                                                  10
#define 		TIM_PSC_PSC_11                                                                  11
#define 		TIM_PSC_PSC_12                                                                  12
#define 		TIM_PSC_PSC_13                                                                  13
#define 		TIM_PSC_PSC_14                                                                  14
#define 		TIM_PSC_PSC_15                                                                  15

/*ARR (TIM Auto-reload Register) Bits.*/

#define 		TIM_ARR_ARR_0                                                                   0
#define 		TIM_ARR_ARR_1                                                                   1
#define 		TIM_ARR_ARR_2                                                                   2
#define 		TIM_ARR_ARR_3                                                                   3
#define 		TIM_ARR_ARR_4                                                                   4
#define 		TIM_ARR_ARR_5                                                                   5
#define 		TIM_ARR_ARR_6                                                                   6
#define 		TIM_ARR_ARR_7                                                                   7
#define 		TIM_ARR_ARR_8                                                                   8
#define 		TIM_ARR_ARR_9                                                                   9
#define 		TIM_ARR_ARR_10                                                                  10
#define 		TIM_ARR_ARR_11                                                                  11
#define 		TIM_ARR_ARR_12                                                                  12
#define 		TIM_ARR_ARR_13                                                                  13
#define 		TIM_ARR_ARR_14                                                                  14
#define 		TIM_ARR_ARR_15                                                                  15


