AhmedAbd-ElFattah/STM32-Drivers/HMCAL/TIM/TIM_defs.h
/*RCR (TIM repetition counter Register) Bits.*/

#define 		TIM_RCR_REP_0                                                                   0
#define 		TIM_RCR_REP_1                                                                   1
#define 		TIM_RCR_REP_2                                                                   2
#define 		TIM_RCR_REP_3                                                                   3
#define 		TIM_RCR_REP_4                                                                   4
#define 		TIM_RCR_REP_5                                                                   5
#define 		TIM_RCR_REP_6                                                                   6
#define 		TIM_RCR_REP_7                                                                   7

/*CCR1 (TIM capture/compare register 1 Register) Bits.*/

#define 		TIM_CCR1_CCR1_0                                                                 0
#define 		TIM_CCR1_CCR1_1                                                                 1
#define 		TIM_CCR1_CCR1_2                                                                 2
#define 		TIM_CCR1_CCR1_3                                                                 3
#define 		TIM_CCR1_CCR1_4                                                                 4
#define 		TIM_CCR1_CCR1_5                                                                 5
#define 		TIM_CCR1_CCR1_6                                                                 6
#define 		TIM_CCR1_CCR1_7                                                                 7
#define 		TIM_CCR1_CCR1_8                                                                 8
#define 		TIM_CCR1_CCR1_9                                                                 9
#define 		TIM_CCR1_CCR1_10                                                                10
#define 		TIM_CCR1_CCR1_11                                                                11
#define 		TIM_CCR1_CCR1_12                                                                12
#define 		TIM_CCR1_CCR1_13                                                                13
#define 		TIM_CCR1_CCR1_14                                                                14
#define 		TIM_CCR1_CCR1_15                                                                15


/*CCR2 (TIM capture/compare register 2 Register) Bits.*/

#define 		TIM_CCR2_CCR2_0                                                                 0
#define 		TIM_CCR2_CCR2_1                                                                 1
#define 		TIM_CCR2_CCR2_2                                                                 2
#define 		TIM_CCR2_CCR2_3                                                                 3
#define 		TIM_CCR2_CCR2_4                                                                 4
#define 		TIM_CCR2_CCR2_5                                                                 5
#define 		TIM_CCR2_CCR2_6                                                                 6
#define 		TIM_CCR2_CCR2_7                                                                 7
#define 		TIM_CCR2_CCR2_8                                                                 8
#define 		TIM_CCR2_CCR2_9                                                                 9
#define 		TIM_CCR2_CCR2_10                                                                10
#define 		TIM_CCR2_CCR2_11                                                                11
#define 		TIM_CCR2_CCR2_12                                                                12
#define 		TIM_CCR2_CCR2_13                                                                13
#define 		TIM_CCR2_CCR2_14                                                                14
#define 		TIM_CCR2_CCR2_15                                                                15


/*CCR3 (TIM capture/compare register 3 Register) Bits.*/

#define 		TIM_CCR3_CCR3_0                                                                 0
#define 		TIM_CCR3_CCR3_1                                                                 1
#define 		TIM_CCR3_CCR3_2                                                                 2
#define 		TIM_CCR3_CCR3_3                                                                 3
#define 		TIM_CCR3_CCR3_4                                                                 4
#define 		TIM_CCR3_CCR3_5                                                                 5
#define 		TIM_CCR3_CCR3_6                                                                 6
#define 		TIM_CCR3_CCR3_7                                                                 7
#define 		TIM_CCR3_CCR3_8                                                                 8
#define 		TIM_CCR3_CCR3_9                                                                 9
#define 		TIM_CCR3_CCR3_10                                                                10
#define 		TIM_CCR3_CCR3_11                                                                11
#define 		TIM_CCR3_CCR3_12                                                                12
#define 		TIM_CCR3_CCR3_13                                                                13
#define 		TIM_CCR3_CCR3_14                                                                14
#define 		TIM_CCR3_CCR3_15                                                                15

/*CCR4 (TIM capture/compare register 4 Register) Bits.*/

#define 		TIM_CCR4_CCR4_0                                                                 0
#define 		TIM_CCR4_CCR4_1                                                                 1
#define 		TIM_CCR4_CCR4_2                                                                 2
#define 		TIM_CCR4_CCR4_3                                                                 3
#define 		TIM_CCR4_CCR4_4                                                                 4
#define 		TIM_CCR4_CCR4_5                                                                 5
#define 		TIM_CCR4_CCR4_6                                                                 6
#define 		TIM_CCR4_CCR4_7                                                                 7
#define 		TIM_CCR4_CCR4_8                                                                 8
#define 		TIM_CCR4_CCR4_9                                                                 9
#define 		TIM_CCR4_CCR4_10                                                                10
#define 		TIM_CCR4_CCR4_11                                                                11
#define 		TIM_CCR4_CCR4_12                                                                12
#define 		TIM_CCR4_CCR4_13                                                                13
#define 		TIM_CCR4_CCR4_14                                                                14
#define 		TIM_CCR4_CCR4_15                                                                15

/*BDTR (TIM break and dead-time register) Bits.*/
#define 		TIM_BDTR_DTG_0                                                                           0
#define 		TIM_BDTR_DTG_1                                                                           1
#define 		TIM_BDTR_DTG_2                                                                           2
#define 		TIM_BDTR_DTG_3                                                                           3
#define 		TIM_BDTR_DTG_4                                                                           4
#define 		TIM_BDTR_DTG_5                                                                           5
#define 		TIM_BDTR_DTG_6                                                                           6
#define 		TIM_BDTR_DTG_7                                                                           7
#define 		TIM_BDTR_LOCK_0                                                                          8
#define 		TIM_BDTR_LOCK_1                                                                          9
#define 		TIM_BDTR_OSSI                                                                            10
#define 		TIM_BDTR_OSSR                                                                            11
#define 		TIM_BDTR_BKE                                                                             12
#define 		TIM_BDTR_BKP                                                                             13
#define 		TIM_BDTR_AOE                                                                             14
#define 		TIM_BDTR_MOE                                                                             15

