AhmedAbd-ElFattah/STM32-Drivers/HMCAL/TIM/TIM_defs.h
/*DCR (TIM DMA control register) Bits.*/
#define			TIM_DCR_DBA_0																			 0
#define			TIM_DCR_DBA_1																			 1
#define			TIM_DCR_DBA_2																			 2
#define			TIM_DCR_DBA_3																			 3
#define			TIM_DCR_DBA_4																			 4

#define			TIM_DCR_DBL_0																			 8
#define			TIM_DCR_DBL_1																			 9
#define			TIM_DCR_DBL_2																			 10
#define			TIM_DCR_DBL_3																			 11
#define			TIM_DCR_DBL_4																			 12

/*DMAR (TIM DMA address for full transfer) Bits.*/

#define 		TIM_DMAR_DMAB_0                                                                 0
#define 		TIM_DMAR_DMAB_1                                                                 1
#define 		TIM_DMAR_DMAB_2                                                                 2
#define 		TIM_DMAR_DMAB_3                                                                 3
#define 		TIM_DMAR_DMAB_4                                                                 4
#define 		TIM_DMAR_DMAB_5                                                                 5
#define 		TIM_DMAR_DMAB_6                                                                 6
#define 		TIM_DMAR_DMAB_7                                                                 7
#define 		TIM_DMAR_DMAB_8                                                                 8
#define 		TIM_DMAR_DMAB_9                                                                 9
#define 		TIM_DMAR_DMAB_10                                                                10
#define 		TIM_DMAR_DMAB_11                                                                11
#define 		TIM_DMAR_DMAB_12                                                                12
#define 		TIM_DMAR_DMAB_13                                                                13
#define 		TIM_DMAR_DMAB_14                                                                14
#define 		TIM_DMAR_DMAB_15                                                                15
#define 		TIM_DMAR_DMAB_16                                                                16
#define 		TIM_DMAR_DMAB_17                                                                17
#define 		TIM_DMAR_DMAB_18                                                                18
#define 		TIM_DMAR_DMAB_19                                                                19
#define 		TIM_DMAR_DMAB_20                                                                20
#define 		TIM_DMAR_DMAB_21                                                                21
#define 		TIM_DMAR_DMAB_22                                                                22
#define 		TIM_DMAR_DMAB_23                                                                23
#define 		TIM_DMAR_DMAB_24                                                                24
#define 		TIM_DMAR_DMAB_25                                                                25
#define 		TIM_DMAR_DMAB_26                                                                26
#define 		TIM_DMAR_DMAB_27                                                                27
#define 		TIM_DMAR_DMAB_28                                                                28
#define 		TIM_DMAR_DMAB_29                                                                29
#define 		TIM_DMAR_DMAB_30                                                                30
#define 		TIM_DMAR_DMAB_31                                                                31
/*
==================================================
  End   Section --> Bit definitions
==================================================
*/

#endif /* HMCAL_TIM_TIM_DEFS_H_ */
